app/controllers/api/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        render json: Event.all,status: :ok